In [195]:
import pandas as pd
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [203]:
df = pd.DataFrame(data)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

## question 0

In [273]:
def filter_animals(df,animal): 
    df = df[df["animal"] == animal]
    df = df[df["age"] < 3]
    return df
filter_animals(df,"cat")

  animal  age  visits priority
0    cat  2.5       1      yes
5    cat  2.0       3       no

## question 1

In [294]:
def filter_dataframe(df):
    numerics = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']
    newdf = df.select_dtypes(include=numerics)
    newdf2 = newdf.dropna()
    return newdf2
filter_dataframe(df)

   age  visits
0  2.5       1
1  3.0       3
2  0.5       2
4  5.0       2
5  2.0       3
6  4.5       1
8  7.0       2
9  3.0       1

## question 2

In [333]:
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
} # return MOST COMMON NAME, AVERAGE AGE, IQR OF RATING

In [347]:
df = pd.DataFrame(d)
df

      Name  Age  Rating
0   Andres   25    4.23
1    James   26    3.24
2    David   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    David   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [348]:
def computer_statistics(df):
    df = pd.DataFrame(df)
    this = df.Name.mode()
    name = str(this[0])
    age = df.Age.mean()
    q75, q25 = np.percentile(df.Rating, [75 ,25])
    iqr = q75 - q25
    iqr
    return name, age, iqr
computer_statistics(d)

('David', 31.833333333333332, 0.9024999999999999)

## question 3

In [ ]:
SQL = """
        select first_name, last_name, manager_id from employees where manager_id in 
        (select employee_id from employees where department_id in
        (select department_id from departments where location_id in
        (select location_id from locations where country_id is "US")
        ))
    """

## question 4

In [ ]:
SQL = """
    select job_id, max(salary)-min(salary) as salary_span
    from employees
    where job_id is not 9
    group by job_id
    order by salary_span desc
"""

# Matrix indexing practice

In [5]:
import numpy as np
A = np.random.rand(5,5)
A

array([[0.84297167, 0.51062495, 0.88398656, 0.6724238 , 0.68126069],
       [0.67921144, 0.53078859, 0.32705956, 0.59706071, 0.17236119],
       [0.34808433, 0.9830868 , 0.34939528, 0.67787007, 0.22249924],
       [0.54926871, 0.9840623 , 0.36241802, 0.28994618, 0.29135483],
       [0.40976045, 0.18399919, 0.93693835, 0.15935058, 0.8230145 ]])

In [12]:
A[1:] # start from row 1, not 0. If 0 leave it blank

array([[0.67921144, 0.53078859, 0.32705956, 0.59706071, 0.17236119],
       [0.34808433, 0.9830868 , 0.34939528, 0.67787007, 0.22249924],
       [0.54926871, 0.9840623 , 0.36241802, 0.28994618, 0.29135483],
       [0.40976045, 0.18399919, 0.93693835, 0.15935058, 0.8230145 ]])

In [16]:
A[:3] # row 0 until row 3.

array([[0.84297167, 0.51062495, 0.88398656, 0.6724238 , 0.68126069],
       [0.67921144, 0.53078859, 0.32705956, 0.59706071, 0.17236119],
       [0.34808433, 0.9830868 , 0.34939528, 0.67787007, 0.22249924]])

In [18]:
A[:,1:] # all rows, start from column 1

array([[0.51062495, 0.88398656, 0.6724238 , 0.68126069],
       [0.53078859, 0.32705956, 0.59706071, 0.17236119],
       [0.9830868 , 0.34939528, 0.67787007, 0.22249924],
       [0.9840623 , 0.36241802, 0.28994618, 0.29135483],
       [0.18399919, 0.93693835, 0.15935058, 0.8230145 ]])

In [20]:
A[:,:2] # all rows, up to column 2

array([[0.84297167, 0.51062495],
       [0.67921144, 0.53078859],
       [0.34808433, 0.9830868 ],
       [0.54926871, 0.9840623 ],
       [0.40976045, 0.18399919]])

# A[ rowstart : rowend , colstart : colend ]

In [22]:
A[:1]

array([[0.84297167, 0.51062495, 0.88398656, 0.6724238 , 0.68126069]])